# Machine Learning Course

## Handling Missing Values

In [1]:
# importing Python Library
import pandas as pd #For data analytics

In [ ]:
dataset=pd.read_csv(r"C:\Machine_Learning_Course\ML_Practice_Dataset_500.csv") #load the data...r is the raw string
dataset.head(3) #to view 3 data entry
#it shows NAn is the datat enry is missing

,ID,Age,Salary,Department,Education_Level,Experience_Years,Purchased,Performance_Score
0,367,41.0,54444.022560,Support,PhD,3,No,86.631826
1,47,NaN,75323.249876,Sales,PhD,39,Yes,53.340217
2,79,57.0,36889.913924,IT,High School,2,No,66.698145

In [ ]:
# Finding no of rows and columns...
dataset.shape

(500, 8)

In [12]:
#for finding the no of rows use .shape[0] and for no of column use .shape[1]
dataset.shape[0]

500

In [ ]:
dataset.isnull() #if missing content it return true else false

,ID,Age,Salary,Department,Education_Level,Experience_Years,Purchased,Performance_Score
0,False,False,False,False,False,False,False,False
1,False,True,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
495,False,False,False,False,False,False,False,False
496,False,False,False,False,False,False,False,False
497,False,False,False,False,False,False,False,False
498,False,True,False,False,False,False,False,False
499,False,False,False,False,False,False,False,False

In [11]:
dataset.isnull().sum() #to count the no. of null values in each column

ID                    0
Age                  95
Salary                0
Department            0
Education_Level       0
Experience_Years      0
Purchased             0
Performance_Score     0
dtype: int64

In [14]:
#finding the percentage of missing value that is percentage null value so that we can have the idea either to remove or not
(dataset.isnull().sum()/dataset.shape[0])*100

ID                    0.0
Age                  19.0
Salary                0.0
Department            0.0
Education_Level       0.0
Experience_Years      0.0
Purchased             0.0
Performance_Score     0.0
dtype: float64